Revit 2027 API
BuiltInFailures.RoofFailures.ExtrudedRoofCutBySketch Property
 Entire extruded Roof is cut by cut Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtrudedRoofCutBySketch { get; }
Public Shared ReadOnly Property ExtrudedRoofCutBySketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtrudedRoofCutBySketch {
	FailureDefinitionId^ get ();
}
static member ExtrudedRoofCutBySketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace